import  pytest


from src.widget import get_date

def test_get_date(test_date):
    """Тест с использованием фикстуры"""
    assert get_date("2024-03-11T02:26:18.671407") == test_date


@pytest.mark.parametrize(
    "str_date, expected",
    [
        ("2024-12-31T23:59:59.999999", "31.12.2024"),
        ("2024-01-01T00:00:00.000000", "01.01.2024"),
        ("2024-02-29T12:00:00.000000", "Указана не существующая дата"),
        ("2025-04-31T02:26:18.6714070", "Указана не существующая дата"),
        ("2025-00-29T02:26:18.6714070", "Указана не существующая дата"),
        ("2025-02-00T02:26:18.6714070", "Указана не существующая дата"),
        ("0000-05-24T02:26:18.6714070", "Указана не существующая дата"),
        ("9900-05-13T02:26:18.6714070", "Указана не существующая дата"),
        ("2025.01.12T02:26:18.6714070", "Указан не верный формат даты"),
        ("2025/01/12T02:26:18.6714070", "Указан не верный формат даты"),
        ("12-01-2025T02:26:18.6714070", "Указан не верный формат даты"),
        ("01-12-2025T02:26:18.6714070", "Указан не верный формат даты"),
        ]
)
def test_get_date_1(str_date, expected):
    """Тест с использованием параметризации"""
    assert get_date(str_date) == expected
